In [1]:
import pandas as pd
read=pd.read_csv('Area, production and yield of cash crops in Nepal.csv')

In [5]:
read.tail()

       Year AD  Year BS  Crop   Area  Production  Yield
100  2000/2001  2057/58  JUTE  11289       16392   1452
101  2001/2002  2058/59  JUTE  11000       16000   1455
102  2002/2003  2059/60  JUTE  11851       17035   1437
103  2003/2004  2060/61  JUTE  11790       16890   1433
104  2004/2005  2061/62  JUTE  11159       16207   1452

In [4]:
len(read)

105

In [15]:
# dir(read)

In [8]:
read.Crop.shape

(105,)

In [9]:
read.Area

0      127820
1      137920
2      142890
3      151490
4      154860
        ...
100     11289
101     11000
102     11851
103     11790
104     11159
Name: Area, Length: 105, dtype: int64

In [10]:
read.Production

0      84030
1      78390
2      82500
3      94370
4      99190
       ...
100    16392
101    16000
102    17035
103    16890
104    16207
Name: Production, Length: 105, dtype: int64

In [14]:
read.T

,0,1,2,3,4,5,6,7,8,9,...,95,96,97,98,99,100,101,102,103,104
Year AD,1984/85,1985/86,1986/87,1987/88,1988/89,1989/90,1990/91,1991/92,1992/93,1993/94,...,1995/96,1996/97,1997/98,1998/99,1999/2000,2000/2001,2001/2002,2002/2003,2003/2004,2004/2005
Year BS,2041/42,2042/43,2043/44,2044/45,2045/46,2046/47,2047/48,2048/49,2049/50,2050/51,...,2052/53,2053/54,2054/55,2055/56,2056/57,2057/58,2058/59,2059/60,2060/61,2061/62
Crop,OILSEED,OILSEED,OILSEED,OILSEED,OILSEED,OILSEED,OILSEED,OILSEED,OILSEED,OILSEED,...,JUTE,JUTE,JUTE,JUTE,JUTE,JUTE,JUTE,JUTE,JUTE,JUTE
Area,127820,137920,142890,151490,154860,153660,156310,154570,165240,177486,...,11150,11000,12265,11675,14535,11289,11000,11851,11790,11159
Production,84030,78390,82500,94370,99190,98060,92140,87840,93690,107535,...,14950,14000,15545,15195,15175,16392,16000,17035,16890,16207
Yield,657,568,577,623,641,638,589,568,567,606,...,1341,1273,1267,1301,1044,1452,1455,1437,1433,1452

In [16]:
from matplotlib import pyplot as plt
%matplotlib inline

In [ ]:
plt.df(df[''])